// Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам.
// Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 

Console.WriteLine("строка массива");
int mas = Convert.ToInt32 (Console.ReadLine());
string[] array = new string[mas];
string[] ar2 = new string[3];

for (int i = 0; i < stringArray.length; i++)
{
    
}








//Console.WriteLine(array);
